EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f523xx_usbd.c
/*********************************************************************************************************//**
  * @brief  Get Endpoint n Transfer Count.
  * @param  USBD_EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  USBD_TCR_0or1: USBD_TCR_0 or USBD_TCR_1
  * @retval Endpoint Transfer Count
  ***********************************************************************************************************/
u32 USBD_EPTGetTransferCount(USBD_EPTn_Enum USBD_EPTn, USBD_TCR_Enum USBD_TCR_0or1)
{
  return (((_USBD_GetEPTnAddr(USBD_EPTn)->TCR) >> USBD_TCR_0or1) & TCR_MASK);
}

/*********************************************************************************************************//**
  * @brief  Write IN Data from User buffer to USB buffer.
  * @param  USBD_EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pFrom: Source buffer
  * @param  len: Length for write IN data
  * @retval Total length written by this function
  ***********************************************************************************************************/
u32 USBD_EPTWriteINData(USBD_EPTn_Enum USBD_EPTn, u32 *pFrom, u32 len)
{
  u32 bufferlen = USBD_EPTGetBufferLen(USBD_EPTn);
  HT_USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(USBD_EPTn);
  u32 EPTnLen;
  u32 *pTo;

  EPTnLen = (USBD_EPTn == USBD_EPT0) ? USBD_EPTGetTransferCount(USBD_EPTn, USBD_CNTIN):USBD_EPTGetTransferCount(USBD_EPTn, USBD_CNTB0);

  if (len <= bufferlen && EPTnLen == 0)
  {
    pTo = (u32 *)USBD_EPTGetBuffer0Addr(USBD_EPTn);
    _USBD_CopyMemory(pFrom, pTo, ByteLen2WordLen(len));
    USBEPn->TCR = len;
    USBEPn->CSR = NAKTX;
    return len;
  }
  else
  {
    return 0;
  }
}

/*********************************************************************************************************//**
  * @brief  Read OUT Data from USB buffer to User buffer.
  * @param  USBD_EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pTo: Destination memory
  * @param  len: Length for read OUT data, set as 0 for discard current OUT data in the USB buffer
  * @retval Total length read by this function
  ***********************************************************************************************************/
u32 USBD_EPTReadOUTData(USBD_EPTn_Enum USBD_EPTn, u32 *pTo, u32 len)
{
  HT_USBEP_TypeDef *USBEPn = _USBD_GetEPTnAddr(USBD_EPTn);
  u32 EPTnLen = 0;

  if (len != 0)
  {
    EPTnLen = USBD_EPTReadMemory(USBD_EPTn, pTo, len);
  }

  if (EPTnLen != 0 || len == 0)
  {
    USBEPn->CSR = (USBEPn->CSR & NAKRX);
  }

  return EPTnLen;
}

/*********************************************************************************************************//**
  * @brief  Read memory from endpoint buffer.
  * @param  USBD_EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @param  pTo: Destination buffer
  * @param  len: Length for read OUT data
  * @retval Total length read by this function
  ***********************************************************************************************************/
u32 USBD_EPTReadMemory(USBD_EPTn_Enum USBD_EPTn, u32 *pTo, u32 len)
{
  u32 EPTnLen = 0;
  u32 *pFrom;

  EPTnLen = (USBD_EPTn == USBD_EPT0) ? USBD_EPTGetTransferCount(USBD_EPTn, USBD_CNTOUT):USBD_EPTGetTransferCount(USBD_EPTn, USBD_CNTB0);

  if (EPTnLen <= len)
  {
    pFrom = (USBD_EPTn == USBD_EPT0) ? (u32 *)USBD_EPTGetBuffer1Addr(USBD_EPTn):(u32 *)USBD_EPTGetBuffer0Addr(USBD_EPTn);
    _USBD_CopyMemory(pFrom, pTo, ByteLen2WordLen(EPTnLen));
  }

  return EPTnLen;
}
/**
  * @}
  */

/* Private functions ---------------------------------------------------------------------------------------*/
/** @defgroup USBDevice_Private_Function USB Device private functions
  * @{
  */
/*********************************************************************************************************//**
  * @brief  Copy 32 bits memory from pFrom to pTo.
  * @param  pFrom: Source buffer
  * @param  pTo: Destination buffer
  * @param  len: Copy length
  * @retval None
  ***********************************************************************************************************/
static void _USBD_CopyMemory(u32 *pFrom, u32 *pTo, u32 len)
{
  s32 i;
  u32 uFromAligned = (((u32)pFrom & 0x3) == 0) ? 1 : 0;
  u32 uToAligned = (((u32)pTo & 0x3) == 0) ? 1 : 0;
  u8 *pFromByte = (u8 *)pFrom;
  u8 *pToByte = (u8 *)pTo;

  if (uFromAligned == 0)
  {
    if (uToAligned == 0)
    {
      for (i = len - 1; i >= 0; i--)
      {
        *pToByte++ = *pFromByte++;
        *pToByte++ = *pFromByte++;
        *pToByte++ = *pFromByte++;
        *pToByte++ = *pFromByte++;
      }
    }
    else
    {
      u32 uTemp = 0;
      for (i = 0; i < len; i++)
      {
        uTemp = *(pFromByte++) << 0;
        uTemp += *(pFromByte++) << 8;
        uTemp += *(pFromByte++) << 16;
        uTemp += *(pFromByte++) << 24;
        pTo[i] = uTemp;
      }
    }
  }
  else
  {
    if (uToAligned == 0)
    {
      u32 uTemp = 0;
      for (i = len - 1; i >= 0; i--)
      {
        uTemp = pFrom[i];
        *pToByte++ = (uTemp >>  0) & 0xFF;
        *pToByte++ = (uTemp >>  8) & 0xFF;
        *pToByte++ = (uTemp >> 16) & 0xFF;
        *pToByte++ = (uTemp >> 24) & 0xFF;
      }
    }
    else
    {
      for (i = len - 1; i >= 0; i--)
      {
        pTo[i] = pFrom[i];
      }
    }
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Convent USBD_EPTn_Enum to USBEP_TypeDef.
  * @param  USBD_EPTn: USB Endpoint number
  *         @arg USBD_EPT0 ~ USBD_EPT7
  * @retval USBEP0 ~ USBEP7
  ***********************************************************************************************************/
static HT_USBEP_TypeDef * _USBD_GetEPTnAddr(USBD_EPTn_Enum USBD_EPTn)
{
  return ((HT_USBEP_TypeDef *)(HT_USBEP0 + USBD_EPTn));
}

/*********************************************************************************************************//**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length.
  * @retval None
  ***********************************************************************************************************/
static void _delay(u32 nCount)
{
  u32 i;

  for (i = 0; i < nCount; i++)
  {
  }
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
